app/controllers/carts/items_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."cart_id" = $1 LIMIT $2  [["cart_id", 1], ["LIMIT", 11]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "items" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 1], ["product_id", 5], ["quantity", 5], ["created_at", "2019-05-08 14:52:46.139116"], ["updated_at", "2019-05-08 14:52:46.139116"]]
SELECT  "carts".* FROM "carts" ORDER BY "carts"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "items" ON "products"."id" = "items"."product_id" WHERE "items"."cart_id" = $1  [["cart_id", 1]]
---
    def create
      @item = Item.new(product: Product.find(item_params[:product_id]),
                       cart: Cart.first,
                       quantity: item_params[:quantity])
      # render json: item_params
      if @item.save
        render json: Cart.first.products, status: :created

UPDATE "items" SET "product_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["product_id", 2], ["updated_at", "2019-05-09 22:11:17.414180"], ["id", 2]]
---
    def update
      if @item.update(item_params)

SELECT  "carts".* FROM "carts" ORDER BY "carts"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def set_cart
      if(Cart.first.nil?)