app/controllers/carts/totals_controller.rb

    def set_cart
      if(Cart.first.nil?)
        Cart.create
      end
      @cart = Cart.first
---
SELECT  "carts".* FROM "carts" ORDER BY "carts"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-05-09 15:00:49.315720"], ["updated_at", "2019-05-09 15:00:49.315720"]]